/*Да се напише програма каде од стандарден влез се внесува еден 5 цифрен број. Програмата печати 1 доколку бројот е специјален, а 0 во спротивно.
Еден број е специјален доколку за него важи дека е делив со збирот на својата втора и трета цифра и првата,третата и петтата цифра се во строго 
растечки редослед.
Да се внимава на делење со 0, т.е. да се испечати -1 во таков случај.
*/
#include <iostream>
using namespace std;
int main() {
    int n;
    cin >> n;
    int c1 = n / 10000;
    int c2 = (n / 1000) % 10;
    int c3 = (n / 100) % 10;
    int c4 = (n / 10) % 10;
    int c5 = n % 10;
    if (c3 + c5 == 0) {
        cout << "-1"<<endl;
        return 0;
    }
    if (c1 < c3 && c3 < c5) {
        if ((c2 + c3) != 0 && (n % (c2 + c3)) == 0) {
            cout << "1"<<endl;
            return 0;
        }
    }
    cout <<"0"<<endl;
    return 0;
}
