/* На ФИНКИ е време за упис на нови студенти. За студент да се упиши, треба да пристигне на факултетот пред 9 часот и да чека ред за да биде услужен од студентска служба. 
Студентска служба почнува со работа од 9 часот, работи 2 часа, прави пауза 30 минути, работи 1 час, прави пауза 30 минути, работи 2 часа и нејзиното работно време завршува.
На студентска служба и е потребно точно 5 минути да услужи 1 студент.
Ваша задача е, ако знаете кој по ред е одреден студент во редицата за чекање, да го испечатете времето во часови и минути кое тој го чека за да биде услужен или да испечати на стандарден излез доколку студентот не е услужен. */
#include <iostream>
using namespace std;
int main() {
    int student, vreme = 0;
    cin >> student;
    if ( student <= 24 ){
        vreme = ( student - 1 ) * 5;
    }

    else if ( student >= 25 && student <= 36 ){
        vreme = ( student - 1 ) * 5 + 30;
    }
    else if ( student >= 37 && student <= 60 ){
        vreme = ( student - 1 ) * 5 + 60;
    }
    else if (student == 64){
        cout<<"Studentot ne e voopsto usluzen"<<endl;
    }
    else {
        cout << "Ne e usluzhen!";
    }
    if ( student <= 60 ){
        cout << "Hours: " << vreme / 60 << ", minutes: " << vreme % 60;
    }
    return 0;
}

